UBIKS232/stm32-noob/user/main.c
#include <stdio.h> // 覆写fputc, printf通过串口输出
#include "stm32f10x.h"
#include "delay.h"

#define ADC_SINGLE_CHANNEL 1 // 自定义

void init_adc1(void);
void init_usart1(void);
void init_pc13(void);

uint16_t userADCGetDataRegularSoft(void); // 软件触发的adc采样
float userADCGetDataInjectedTRGO(void);
int fputc(int ch, FILE *file); // 输出重定向
void userSerialTransmit(USART_TypeDef *usartTypedef_t, uint8_t *pData, uint16_t size);
void userSerialReceive(USART_TypeDef *usartTypedef_t, uint8_t *pData);

int main(void)
{
    Delay_Init();
    init_pc13();
    init_usart1();
    init_adc1();

    printf("Hello World.\n");

    while (1)
    {
        printf("%.3f\n", userADCGetDataInjectedTRGO());
    }
}

void init_pc13()
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    GPIO_InitTypeDef gpioc = {
        .GPIO_Mode = GPIO_Mode_Out_OD,
        .GPIO_Pin = GPIO_Pin_13,
        .GPIO_Speed = GPIO_Speed_2MHz};
    GPIO_Init(GPIOC, &gpioc);
    GPIO_SetBits(GPIOC, GPIO_Pin_13);
}

void init_adc1()
{
    RCC_ADCCLKConfig(RCC_PCLK2_Div6);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1 | RCC_APB2Periph_GPIOA | RCC_APB2Periph_TIM1, ENABLE);

    // RCC_ClocksTypeDef rcc_clk;
    // RCC_GetClocksFreq(&rcc_clk);
    // int tcal = (int)((1 / (float)rcc_clk.ADCCLK_Frequency) * 1e6 * 4);
    // int tstab = (int)((1 / (float)rcc_clk.ADCCLK_Frequency) * 1e6 * 4);
    // DelayUs(tcal);

    // 72Mhz / 1 / 1000 / 72 = 1kHz
    TIM_TimeBaseInitTypeDef tim1 = {
        .TIM_ClockDivision = TIM_CKD_DIV1, // 1, 2, 4
        .TIM_CounterMode = TIM_CounterMode_Up,
        .TIM_Period = (72 - 1),
        .TIM_Prescaler = (1000 - 1),
        .TIM_RepetitionCounter = 0
    };
    TIM_TimeBaseInit(TIM1, &tim1);
    TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_Update);
    TIM_Cmd(TIM1, ENABLE);

    GPIO_InitTypeDef gpioa = {
        .GPIO_Mode = GPIO_Mode_AIN,
        // .GPIO_Speed = GPIO_Speed_50MHz, // not needed
        .GPIO_Pin = GPIO_Pin_0};
    GPIO_Init(GPIOA, &gpioa);

    ADC_InitTypeDef adc1 = {
        .ADC_ContinuousConvMode = DISABLE,
        .ADC_DataAlign = ADC_DataAlign_Right,
        .ADC_ExternalTrigConv = ADC_ExternalTrigConv_None, // ONLY for regular channel, none 为软件触发
        .ADC_Mode = ADC_Mode_Independent,                  // 双ADC模式, 选独立模式
        .ADC_NbrOfChannel = ADC_SINGLE_CHANNEL,
        .ADC_ScanConvMode = DISABLE};
    ADC_StartCalibration(ADC1);
    while (ADC_GetCalibrationStatus(ADC1) != SET)
        ;
    ADC_Init(ADC1, &adc1);
    // 注入序列额外配置, 有诸多额外的编程接口
    ADC_InjectedSequencerLengthConfig(ADC1, 1);
    ADC_InjectedChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_13Cycles5);
    ADC_ExternalTrigInjectedConvConfig(ADC1, ADC_ExternalTrigInjecConv_T1_TRGO);
    ADC_ExternalTrigInjectedConvCmd(ADC1, ENABLE);
    ADC_Cmd(ADC1, ENABLE);
}

uint16_t userADCGetDataRegularSoft(void)
{
    ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) != SET)
        ;
    uint16_t adc_value = ADC_GetConversionValue(ADC1);
    return adc_value;
}

float userADCGetDataInjectedTRGO(void)
{
    while (ADC_GetFlagStatus(ADC1, ADC_FLAG_JEOC) != SET)
        ;
    float adc_value = ADC_GetInjectedConversionValue(ADC1, ADC_InjectedChannel_1) * (3.3f / 4095);
    ADC_ClearFlag(ADC1, ADC_FLAG_JEOC);
    return adc_value;
}

void init_usart1(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, ENABLE);

    // GPIO_PinRemapConfig(GPIO_Remap_USART1, ENABLE); // managed by AFPIO, enable PB6, PB7 as pins of USART1
    GPIO_InitTypeDef gpioInit_A10 = {
        // .GPIO_Mode = GPIO_Mode_AF_PP, // 配反了...
        .GPIO_Mode = GPIO_Mode_IPU,
        .GPIO_Pin = GPIO_Pin_10,
        .GPIO_Speed = GPIO_Speed_10MHz};
    GPIO_InitTypeDef gpioInit_A9 = {
        // .GPIO_Mode = GPIO_Mode_IPU,
        .GPIO_Mode = GPIO_Mode_AF_PP,
        .GPIO_Pin = GPIO_Pin_9,
        .GPIO_Speed = GPIO_Speed_10MHz};
    GPIO_Init(GPIOA, &gpioInit_A10); // Rx
    GPIO_Init(GPIOA, &gpioInit_A9);  // Tx

    USART_InitTypeDef usartInit = {
        .USART_BaudRate = 115200,
        // .USART_HardwareFlowControl = USART_HardwareFlowControl_None,
        .USART_Mode = USART_Mode_Tx | USART_Mode_Rx,
        .USART_Parity = USART_Parity_No,
        .USART_StopBits = USART_StopBits_1,
        .USART_WordLength = USART_WordLength_8b}; // 9b - 1b(parity) = 8b(data)
    USART_Init(USART1, &usartInit);
    USART_Cmd(USART1, ENABLE);
}

void userSerialTransmit(USART_TypeDef *usartTypedef_t, uint8_t *pData, uint16_t size)
{
    if (size == 0)
        return;

    for (uint32_t i = 0; i < size; i++)
    {
        while (USART_GetFlagStatus(usartTypedef_t, USART_FLAG_TXE) == RESET)
            ;
        // if (USART_GetFlagStatus(usartTypedef_t, USART_FLAG_TXE) == SET); // 不对
        // USART_SendData(usartTypedef_t, *(pData + i));
        USART_SendData(usartTypedef_t, pData[i]);
    }
    while (USART_GetFlagStatus(usartTypedef_t, USART_FLAG_TC) == RESET)
        ;
}

void userSerialReceive(USART_TypeDef *usartTypedef_t, uint8_t *pData)
{
    while (USART_GetFlagStatus(usartTypedef_t, USART_FLAG_RXNE) == RESET)
        ;
    *pData = USART_ReceiveData(usartTypedef_t);
}

int fputc(int ch, FILE *file)
{
    while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET)
        ;
    USART_SendData(USART1, (uint8_t)ch);
    return ch;
}
